vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NSING.N32G4FR_DFP.pdsc
<?xml version="1.0" encoding="UTF-8"?>

<package schemaVersion="1.7.37" 
    xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="https://raw.githubusercontent.com/Open-CMSIS-Pack/Open-CMSIS-Pack-Spec/v1.7.37/schema/PACK.xsd">
    <vendor>NSING</vendor>
    <url>https://www.nsing.com.sg/public/uploads/armpacks/</url>
    <name>N32G4FR_DFP</name>
    <description>Nsing N32G4FR Series Device Support, Drivers and Examples</description>

    <releases>
		<release date="2024-08-14" version="1.0.6">		    
            First release of N32G4FR_DFP
        </release>
    </releases>

    <keywords>
        <keyword>NSING</keyword>
        <keyword>Device Support</keyword>
        <keyword>N32G4FR</keyword>
		<keyword>N32</keyword>
    </keywords>

    <devices>
        <family Dfamily="N32G4FR Series" Dvendor="NSING:185">
          <processor Dcore="Cortex-M4" DcoreVersion="r0p1" Dfpu="1" Dmpu="1" Dendian="Little-endian"/>
          <subFamily DsubFamily="N32G4FR">	  
		   <processor Dclock="144000000"/>	
           <description>
Up to 144MHz ARM Cortex-M4F, 512KB Flash, 144KB SRAM, 7xU(S)ART, 4xI2C, 3xSPI, 1xQSPI, USB 2.0 FS Device, RTC, 2x 12bit 5Msps ADC, 2x12bit DAC, DVP, up to 18 Channels TSC, Hardware Cryptographic Engine, Fingerprint algorithm.
           </description>	   
           <compile header="firmware/CMSIS/device/n32g4fr.h" define="N32G4FR USE_STDPERIPH_DRIVER"/>  
	  	   <feature type="VCC"      n="1.80"        m="5.50"/>		
		   <feature type="Temp"     n="-40"        m="105"/>	
		   <feature type="RTC"      n="1"/>		   
		  <!-- *************************  Device 'N32G4FRKCQ7'  ***************************** -->
		  <device Dname="N32G4FRKCQ7"> 
			<description>
- Package: QFN32
- TSC: 2x		
- QSPI: 1x
- LCD: 1x
			</description>				
		    <feature type="Memory"   n="256" 	name="256KB Flash"/>	
		    <feature type="Memory"   n="144" 	name="144KB SRAM"/>	
			<feature type="IOs"      n="24"     name="Input and Output Ports"/>
			<feature type="Timer"    n="6"/>
			<feature type="PWM"      n="10"/>				
			<feature type="ADC"      n="1"/>	
			<feature type="DAC"      n="2"/>	
			<feature type="USART"    n="1"/>
			<feature type="UART"     n="3"/>	
		    <feature type="SPI"      n="2"/>	
			<feature type="I2C"      n="3"/>
			<feature type="USBD"     n="1"/>		
			<feature type="CAN"      n="1"/>				
			
			<memory id="IRAM1"   start="0x20000000" size="0x24000" default="1" init="0"/>
			<memory id="IROM1"   start="0x08000000" size="0x40000" default="1" startup="1"/>
			<algorithm name="Flash/N32G4FR.FLM" start="0x08000000" size="0x40000" default="1"/>
			<debug svd="svd/N32G4FR.svd"/>
          </device>	
		 <!-- *************************  Device 'N32G4FRKEQ7'  ***************************** -->
		  <device Dname="N32G4FRKEQ7"> 
			<description>
- Package: QFN32
- TSC: 2x		
- QSPI: 1x
- LCD: 1x
			</description>				
		    <feature type="Memory"   n="512" 	name="512KB Flash"/>	
		    <feature type="Memory"   n="144" 	name="144KB SRAM"/>	
			<feature type="IOs"      n="24"     name="Input and Output Ports"/>
			<feature type="Timer"    n="6"/>
			<feature type="PWM"      n="10"/>				
			<feature type="ADC"      n="1"/>	
			<feature type="DAC"      n="2"/>	
			<feature type="USART"    n="1"/>
			<feature type="UART"     n="3"/>	
		    <feature type="SPI"      n="2"/>	
			<feature type="I2C"      n="3"/>
			<feature type="USBD"     n="1"/>		
			<feature type="CAN"      n="1"/>				
			
			<memory id="IRAM1"   start="0x20000000" size="0x24000" default="1" init="0"/>
			<memory id="IROM1"   start="0x08000000" size="0x80000" default="1" startup="1"/>
			<algorithm name="Flash/N32G4FR.FLM" start="0x08000000" size="0x80000" default="1"/>
			<debug svd="svd/N32G4FR.svd"/>
          </device>
		 <!-- *************************  Device 'N32G4FRHCQ7'  ***************************** -->
		  <device Dname="N32G4FRHCQ7"> 
			<description>
- Package: QFN40
- TSC: 2x		
- QSPI: 1x
- LCD: 1x
- DVP: 1x
			</description>				
		    <feature type="Memory"   n="256" 	name="256KB Flash"/>	
		    <feature type="Memory"   n="144" 	name="144KB SRAM"/>	
			<feature type="IOs"      n="32"     name="Input and Output Ports"/>
			<feature type="Timer"    n="7"/>
			<feature type="PWM"      n="12"/>				
			<feature type="ADC"      n="1"/>	
			<feature type="DAC"      n="2"/>	
			<feature type="USART"    n="2"/>
			<feature type="UART"     n="4"/>	
		    <feature type="SPI"      n="3"/>	
			<feature type="I2C"      n="4"/>
			<feature type="USBD"     n="1"/>		
			<feature type="CAN"      n="2"/>				
			
			<memory id="IRAM1"   start="0x20000000" size="0x24000" default="1" init="0"/>
			<memory id="IROM1"   start="0x08000000" size="0x40000" default="1" startup="1"/>
			<algorithm name="Flash/N32G4FR.FLM" start="0x08000000" size="0x40000" default="1"/>
			<debug svd="svd/N32G4FR.svd"/>
          </device>
		 <!-- *************************  Device 'N32G4FRHEQ7'  ***************************** -->
		  <device Dname="N32G4FRHEQ7"> 
			<description>
- Package: QFN40
- TSC: 2x		
- QSPI: 1x
- LCD: 1x
- DVP: 1x
			</description>				
		    <feature type="Memory"   n="512" 	name="512KB Flash"/>	
		    <feature type="Memory"   n="144" 	name="144KB SRAM"/>	
			<feature type="IOs"      n="32"     name="Input and Output Ports"/>
			<feature type="Timer"    n="7"/>
			<feature type="PWM"      n="12"/>				
			<feature type="ADC"      n="2"/>	
			<feature type="DAC"      n="2"/>	
			<feature type="USART"    n="2"/>
			<feature type="UART"     n="4"/>	
		    <feature type="SPI"      n="3"/>	
			<feature type="I2C"      n="4"/>
			<feature type="USBD"     n="1"/>		
			<feature type="CAN"      n="2"/>				
			
			<memory id="IRAM1"   start="0x20000000" size="0x24000" default="1" init="0"/>
			<memory id="IROM1"   start="0x08000000" size="0x80000" default="1" startup="1"/>
			<algorithm name="Flash/N32G4FR.FLM" start="0x08000000" size="0x80000" default="1"/>
			<debug svd="svd/N32G4FR.svd"/>
          </device>
		 <!-- *************************  Device 'N32G4FRREL7'  ***************************** -->
		  <device Dname="N32G4FRREL7"> 
			<description>
- Package: LQFP64
- TSC: 1x		
- QSPI: 1x
- LCD: 1x
- DVP: 1x
			</description>				
		    <feature type="Memory"   n="512" 	name="512KB Flash"/>	
		    <feature type="Memory"   n="144" 	name="144KB SRAM"/>	
			<feature type="IOs"      n="51"     name="Input and Output Ports"/>
			<feature type="Timer"    n="8"/>
			<feature type="PWM"      n="12"/>				
			<feature type="ADC"      n="2"/>	
			<feature type="DAC"      n="2"/>	
			<feature type="USART"    n="3"/>
			<feature type="UART"     n="4"/>	
		    <feature type="SPI"      n="3"/>	
			<feature type="I2C"      n="4"/>
			<feature type="USBD"     n="1"/>		
			<feature type="CAN"      n="2"/>				
			<feature type="SDIO"     n="1"/>	
			
			<memory id="IRAM1"   start="0x20000000" size="0x24000" default="1" init="0"/>
			<memory id="IROM1"   start="0x08000000" size="0x80000" default="1" startup="1"/>
			<algorithm name="Flash/N32G4FR.FLM" start="0x08000000" size="0x80000" default="1"/>
			<debug svd="svd/N32G4FR.svd"/>
          </device>		  
		 <!-- *************************  Device 'N32G4FRMEL7'  ***************************** -->
		  <device Dname="N32G4FRMEL7"> 
			<description>
- Package: LQFP80
- TSC: 1x		
- QSPI: 1x
- LCD: 1x
- DVP: 1x
			</description>				
		    <feature type="Memory"   n="512" 	name="512KB Flash"/>	
		    <feature type="Memory"   n="144" 	name="144KB SRAM"/>	
			<feature type="IOs"      n="67"     name="Input and Output Ports"/>
			<feature type="Timer"    n="8"/>
			<feature type="PWM"      n="24"/>				
			<feature type="ADC"      n="2"/>	
			<feature type="DAC"      n="2"/>	
			<feature type="USART"    n="3"/>
			<feature type="UART"     n="4"/>	
		    <feature type="SPI"      n="3"/>	
			<feature type="I2C"      n="4"/>
			<feature type="USBD"     n="1"/>		
			<feature type="CAN"      n="2"/>				
			<feature type="SDIO"     n="1"/>	
			
			<memory id="IRAM1"   start="0x20000000" size="0x24000" default="1" init="0"/>
			<memory id="IROM1"   start="0x08000000" size="0x80000" default="1" startup="1"/>
			<algorithm name="Flash/N32G4FR.FLM" start="0x08000000" size="0x80000" default="1"/>
			<debug svd="svd/N32G4FR.svd"/>
          </device>		
		  </subFamily>    
	
        </family>
    </devices>


    <conditions>   	
		<!-- Device Conditions -->
		<condition id="N32G4FR">
		  <description>NSING N32G4FR Devices</description> 
		  <require Dvendor="NSING:185" Dname="N32*"/> 
		</condition>
		
		<!-- Device + CMSIS Conditions -->
        <condition id="N32G4FR CMSIS">            
		    <description>NSING N32G4FR Device and the ARM compiler</description>
		    <require condition="N32G4FR"/>
		    <require Tcompiler="ARMCC"/>
        </condition>

		<!-- N32G4FR STDPERIPHERALS MISC Conditions -->
        <condition id="N32G4FR STDPERIPHERALS">
            <description>NSING N32G4FR Standard Peripherals drivers</description>
            <require condition="N32G4FR CMSIS"/>
            <require Cclass="Device" Cgroup="N32G4FR_StdPeripherals" Csub="MISC"/>
        </condition>
		
		<!-- N32G4FR STDPERIPHERALS RCC Conditions -->
        <condition id="N32G4FR STDPERIPHERALS RCC">
            <description>NSING N32G4FR Standard Peripherals driver with RCC</description>
            <require condition="N32G4FR STDPERIPHERALS"/>
            <require Cclass="Device" Cgroup="N32G4FR_StdPeripherals" Csub="RCC"/>
        </condition>
		
