vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NSING.N32G4FR_DFP.pdsc
		<condition id="N32G4FR Algorithm Common" >
            <description>NSING N32G4FR Series Algorithm Libraries Common Functions.</description>
            <require condition="N32G4FR CMSIS"/>
            <require Cclass ="Device" Cgroup="Algorithm Libs" Csub="Common"/>
        </condition>

    </conditions>

    <components>
		<component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="N32G4FR CMSIS">
            <description>Startup File for Nsing N32G4FR Series</description>
            <files>
                <file category="include" name="firmware/CMSIS/device/"/>
				<file category="header" name="firmware/CMSIS/device/n32g4fr.h"/>
				<!-- startup file -->				
                <file category="source" name="firmware/CMSIS/device/startup/startup_n32g4fr.s" attr="config"  version="1.0.0" condition="N32G4FR CMSIS"/>
				<!-- system file -->
                <file category="source" name="firmware/CMSIS/device/system_n32g4fr.c" attr="config" version="1.0.0"/>
				
            </files>
        </component>
		
	    <!-- N32G4FR_StdPeripherals -->		
        <component Cclass="Device" Cgroup="N32G4FR_StdPeripherals" Csub="MISC" Cversion="1.0.0" condition="N32G4FR CMSIS">
            <description>Standard Peripherals Drivers Framework</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_FRAMEWORK
            </RTE_Components_h>
            <files>
                <file category="include" name="firmware/n32g4fr_std_periph_driver/inc/"/>
                <file category="source" name="firmware/n32g4fr_std_periph_driver/src/misc.c"/>
            </files>
        </component>
		
        <component Cclass="Device" Cgroup="N32G4FR_StdPeripherals" Csub="ADC" Cversion="1.0.0" condition="N32G4FR STDPERIPHERALS RCC">
            <description>Analog-to-digital converter (ADC) driver for N32G4FR</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_ADC
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g4fr_std_periph_driver/inc/n32g4fr_adc.h"/>
                <file category="source" name="firmware/n32g4fr_std_periph_driver/src/n32g4fr_adc.c"/>
            </files>
        </component>		

        <component Cclass="Device" Cgroup="N32G4FR_StdPeripherals" Csub="BKP" Cversion="1.0.0" condition="N32G4FR STDPERIPHERALS RCC">
            <description>Backup registers (BKPR) driver for N32G4FR</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_BKP
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g4fr_std_periph_driver/inc/n32g4fr_bkp.h"/>
                <file category="source" name="firmware/n32g4fr_std_periph_driver/src/n32g4fr_bkp.c"/>
            </files>
        </component>
		
        <component Cclass="Device" Cgroup="N32G4FR_StdPeripherals" Csub="CAN" Cversion="1.0.0" condition="N32G4FR STDPERIPHERALS RCC">
            <description>Controller area network (CAN) driver for N32G4FR</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_CAN
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g4fr_std_periph_driver/inc/n32g4fr_can.h"/>
                <file category="source" name="firmware/n32g4fr_std_periph_driver/src/n32g4fr_can.c"/>
            </files>
        </component>
		
<!--         <component Cclass="Device" Cgroup="N32G4FR_StdPeripherals" Csub="COMP" Cversion="1.0.0" condition="N32G4FR STDPERIPHERALS RCC">
            <description>Comparator (COMP) driver for N32G4FR</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_COMP
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g4fr_std_periph_driver/inc/n32g4fr_comp.h"/>
                <file category="source" name="firmware/n32g4fr_std_periph_driver/src/n32g4fr_comp.c"/>
            </files>
        </component> -->
		
        <component Cclass="Device" Cgroup="N32G4FR_StdPeripherals" Csub="CRC" Cversion="1.0.0" condition="N32G4FR STDPERIPHERALS RCC">
            <description>CRC calculation unit (CRC) driver for N32G4FR</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_CRC
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g4fr_std_periph_driver/inc/n32g4fr_crc.h"/>
                <file category="source" name="firmware/n32g4fr_std_periph_driver/src/n32g4fr_crc.c"/>
            </files>
        </component>
		
       <component Cclass="Device" Cgroup="N32G4FR_StdPeripherals" Csub="DBG" Cversion="1.0.0" condition="N32G4FR STDPERIPHERALS RCC">
            <description>MCU debug component (DBG) driver for N32G4FR</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_DBG
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g4fr_std_periph_driver/inc/n32g4fr_dbg.h"/>
                <file category="source" name="firmware/n32g4fr_std_periph_driver/src/n32g4fr_dbg.c"/>
            </files>
        </component>
 
         <component Cclass="Device" Cgroup="N32G4FR_StdPeripherals" Csub="DAC" Cversion="1.0.0" condition="N32G4FR STDPERIPHERALS RCC">
            <description>Digital-to-analog converter (DAC) driver for N32G4FR</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_DAC
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g4fr_std_periph_driver/inc/n32g4fr_dac.h"/>
                <file category="source" name="firmware/n32g4fr_std_periph_driver/src/n32g4fr_dac.c"/>
            </files>
        </component>
		
        <component Cclass="Device" Cgroup="N32G4FR_StdPeripherals" Csub="DMA" Cversion="1.0.0" condition="N32G4FR STDPERIPHERALS RCC">
            <description>DMA controller (DMA) driver for N32G4FR</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_DMA
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g4fr_std_periph_driver/inc/n32g4fr_dma.h"/>
                <file category="source" name="firmware/n32g4fr_std_periph_driver/src/n32g4fr_dma.c"/>
            </files>
        </component>

        <component Cclass="Device" Cgroup="N32G4FR_StdPeripherals" Csub="DVP" Cversion="1.0.0" condition="N32G4FR STDPERIPHERALS RCC">
            <description>Digital video port (DVP) driver for N32G4FR</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_DVP
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g4fr_std_periph_driver/inc/n32g4fr_dvp.h"/>
                <file category="source" name="firmware/n32g4fr_std_periph_driver/src/n32g4fr_dvp.c"/>
            </files>
        </component>
		
