vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NSING.N32G4FR_DFP.pdsc
        <component Cclass="Device" Cgroup="N32G4FR_StdPeripherals" Csub="EXTI" Cversion="1.0.0" condition="N32G4FR STDPERIPHERALS RCC">
            <description>External interrupt/event controller (EXTI) driver for N32G4FR</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_EXTI
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g4fr_std_periph_driver/inc/n32g4fr_exti.h"/>
                <file category="source" name="firmware/n32g4fr_std_periph_driver/src/n32g4fr_exti.c"/>
            </files>
        </component>
		
        <component Cclass="Device" Cgroup="N32G4FR_StdPeripherals" Csub="FLASH" Cversion="1.0.0" condition="N32G4FR STDPERIPHERALS RCC">
            <description>Embedded Flash memory (FLASH) driver for N32G4FR</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_FLASH
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g4fr_std_periph_driver/inc/n32g4fr_flash.h"/>
                <file category="source" name="firmware/n32g4fr_std_periph_driver/src/n32g4fr_flash.c"/>
            </files>
        </component>

        <component Cclass="Device" Cgroup="N32G4FR_StdPeripherals" Csub="GPIO" Cversion="1.0.0" condition="N32G4FR STDPERIPHERALS RCC">
            <description>General-purpose I/O (GPIO) driver for N32G4FR</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_GPIO
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g4fr_std_periph_driver/inc/n32g4fr_gpio.h"/>
                <file category="source" name="firmware/n32g4fr_std_periph_driver/src/n32g4fr_gpio.c"/>
            </files>
        </component>
		
        <component Cclass="Device" Cgroup="N32G4FR_StdPeripherals" Csub="I2C" Cversion="1.0.0" condition="N32G4FR STDPERIPHERALS RCC">
            <description>Inter-integrated circuit (I2C) interface driver for N32G4FR</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_I2C
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g4fr_std_periph_driver/inc/n32g4fr_i2c.h"/>
                <file category="source" name="firmware/n32g4fr_std_periph_driver/src/n32g4fr_i2c.c"/>
            </files>
        </component>

        <component Cclass="Device" Cgroup="N32G4FR_StdPeripherals" Csub="IWDG" Cversion="1.0.0" condition="N32G4FR STDPERIPHERALS RCC">
            <description>Independent watchdog (IWDG) driver for N32G4FR</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_IWDG
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g4fr_std_periph_driver/inc/n32g4fr_iwdg.h"/>
                <file category="source" name="firmware/n32g4fr_std_periph_driver/src/n32g4fr_iwdg.c"/>
            </files>
        </component>

<!--         <component Cclass="Device" Cgroup="N32G4FR_StdPeripherals" Csub="LCD" Cversion="1.0.0" condition="N32G4FR STDPERIPHERALS RCC">
            <description>Liquid Crystal Display (LCD) driver for N32G4FR</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_LCD
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g4fr_std_periph_driver/inc/n32g4fr_lcd.h"/>
                <file category="source" name="firmware/n32g4fr_std_periph_driver/src/n32g4fr_lcd.c"/>
            </files>
        </component> -->

<!--         <component Cclass="Device" Cgroup="N32G4FR_StdPeripherals" Csub="LPRCNT" Cversion="1.0.0" condition="N32G4FR STDPERIPHERALS RCC">
            <description>Low Power Counter (LPRCNT) driver for N32G4FR</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_LPRCNT
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g4fr_std_periph_driver/inc/n32g4fr_lprcnt.h"/>
                <file category="source" name="firmware/n32g4fr_std_periph_driver/src/n32g4fr_lprcnt.c"/>
            </files>
        </component>
		
        <component Cclass="Device" Cgroup="N32G4FR_StdPeripherals" Csub="LPTIM" Cversion="1.0.0" condition="N32G4FR STDPERIPHERALS RCC">
            <description>Low Power Timers (LPTIM) driver for N32G4FR</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_LPTIM
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g4fr_std_periph_driver/inc/n32g4fr_lptim.h"/>
                <file category="source" name="firmware/n32g4fr_std_periph_driver/src/n32g4fr_lptim.c"/>
            </files>
        </component>

        <component Cclass="Device" Cgroup="N32G4FR_StdPeripherals" Csub="LPUART" Cversion="1.0.0" condition="N32G4FR STDPERIPHERALS RCC">
            <description>Low Power Universal asynchronous receiver transmitter (LPUART) driver for N32G4FR</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_LPUART
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g4fr_std_periph_driver/inc/n32g4fr_lpuart.h"/>
                <file category="source" name="firmware/n32g4fr_std_periph_driver/src/n32g4fr_lpuart.c"/>
            </files>
        </component> -->
		
<!--         <component Cclass="Device" Cgroup="N32G4FR_StdPeripherals" Csub="OPAMP" Cversion="1.0.0" condition="N32G4FR STDPERIPHERALS RCC">
            <description>Operational amplifier (OPAMP) driver for N32G4FR</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_OPAMP
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g4fr_std_periph_driver/inc/n32g4fr_opamp.h"/>
                <file category="source" name="firmware/n32g4fr_std_periph_driver/src/n32g4fr_opamp.c"/>
            </files>
        </component> -->
		
        <component Cclass="Device" Cgroup="N32G4FR_StdPeripherals" Csub="PWR" Cversion="1.0.0" condition="N32G4FR STDPERIPHERALS RCC">
            <description>Power controller (PWR) driver for N32G4FR</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_PWR
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g4fr_std_periph_driver/inc/n32g4fr_pwr.h"/>
                <file category="source" name="firmware/n32g4fr_std_periph_driver/src/n32g4fr_pwr.c"/>
            </files>
        </component>

        <component Cclass="Device" Cgroup="N32G4FR_StdPeripherals" Csub="QSPI" Cversion="1.0.0" condition="N32G4FR STDPERIPHERALS RCC">
            <description>Queued SPI (QSPI) driver for N32G4FR</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_QSPI
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g4fr_std_periph_driver/inc/n32g4fr_qspi.h"/>
                <file category="source" name="firmware/n32g4fr_std_periph_driver/src/n32g4fr_qspi.c"/>
            </files>
        </component>
		
